lkolbly/cmsis-svd/data/TexasInstruments/LM3S1G58.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <prependToName>ADC1</prependToName>
      <baseAddress>0x40039000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTJ</name>
      <prependToName>GPIO_PORTJ</prependToName>
      <baseAddress>0x4003D000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTA_AHB</name>
      <prependToName>GPIO_PORTA_AHB</prependToName>
      <baseAddress>0x40058000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTB_AHB</name>
      <prependToName>GPIO_PORTB_AHB</prependToName>
      <baseAddress>0x40059000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTC_AHB</name>
      <prependToName>GPIO_PORTC_AHB</prependToName>
      <baseAddress>0x4005A000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTD_AHB</name>
      <prependToName>GPIO_PORTD_AHB</prependToName>
      <baseAddress>0x4005B000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTE_AHB</name>
      <prependToName>GPIO_PORTE_AHB</prependToName>
      <baseAddress>0x4005C000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTF_AHB</name>
      <prependToName>GPIO_PORTF_AHB</prependToName>
      <baseAddress>0x4005D000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTG_AHB</name>
      <prependToName>GPIO_PORTG_AHB</prependToName>
      <baseAddress>0x4005E000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTH_AHB</name>
      <prependToName>GPIO_PORTH_AHB</prependToName>
      <baseAddress>0x4005F000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTJ_AHB</name>
      <prependToName>GPIO_PORTJ_AHB</prependToName>
      <baseAddress>0x40060000</baseAddress>
    </peripheral>
    <peripheral>
      <name>HIB</name>
      <description>Register map for HIB peripheral</description>
      <groupName>HIB</groupName>
      <prependToName>HIB</prependToName>
      <baseAddress>0x400FC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RTCC</name>
          <description>Hibernation RTC Counter</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCC</name>
              <description>RTC Counter</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCM0</name>
          <description>Hibernation RTC Match 0</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCM0</name>
              <description>RTC Match 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCM1</name>
          <description>Hibernation RTC Match 1</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCM1</name>
              <description>RTC Match 1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCLD</name>
          <description>Hibernation RTC Load</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCLD</name>
              <description>RTC Load</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Hibernation Control</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>HIB_CTL_RTCEN</name>
              <description>RTC Timer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_HIBREQ</name>
              <description>Hibernation Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_CLKSEL</name>
              <description>Hibernation Module Clock Select</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_RTCWEN</name>
              <description>RTC Wake-up Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_PINWEN</name>
              <description>External WAKE Pin Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_LOWBATEN</name>
              <description>Low Battery Monitoring Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_CLK32EN</name>
              <description>Clocking Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_VABORT</name>
              <description>Power Cut Abort Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_VDD3ON</name>
              <description>VDD Powered</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_WRC</name>
              <description>Write Complete/Capable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>Hibernation Interrupt Mask</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>HIB_IM_RTCALT0</name>
              <description>RTC Alert 0 Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_IM_RTCALT1</name>
              <description>RTC Alert 1 Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_IM_LOWBAT</name>
              <description>Low Battery Voltage Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_IM_EXTW</name>
              <description>External Wake-Up Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Hibernation Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>HIB_RIS_RTCALT0</name>
              <description>RTC Alert 0 Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_RTCALT1</name>
              <description>RTC Alert 1 Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_LOWBAT</name>
              <description>Low Battery Voltage Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_EXTW</name>
              <description>External Wake-Up Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Hibernation Masked Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>HIB_MIS_RTCALT0</name>
              <description>RTC Alert 0 Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_RTCALT1</name>
              <description>RTC Alert 1 Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_LOWBAT</name>
              <description>Low Battery Voltage Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_EXTW</name>
              <description>External Wake-Up Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>Hibernation Interrupt Clear</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>HIB_IC_RTCALT0</name>
              <description>RTC Alert0 Masked Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_IC_RTCALT1</name>
              <description>RTC Alert1 Masked Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_IC_LOWBAT</name>
              <description>Low Battery Voltage Masked Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_IC_EXTW</name>
              <description>External Wake-Up Masked Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCT</name>
          <description>Hibernation RTC Trim</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCT_TRIM</name>
              <description>RTC Trim Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Hibernation Data</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>HIB_DATA_RTD</name>
              <description>Hibernation Module NV Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
